OpFile/Changesolver/constant/floor/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/floor/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    fmaxY
    {
        type            patch;
        nFaces          90;
        startFace       7020;
    }
    fminX
    {
        type            patch;
        nFaces          90;
        startFace       7110;
    }
    fmaxX
    {
        type            patch;
        nFaces          90;
        startFace       7200;
    }
    fminY
    {
        type            patch;
        nFaces          90;
        startFace       7290;
    }
    fminZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       7380;
    }
    floor_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          900;
        startFace       8280;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_floor;
    }
)

// ************************************************************************* //
