OpFile/Changesolver/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    maxY
    {
        type            patch;
        nFaces          990;
        startFace       114444;
    }
    minX
    {
        type            patch;
        nFaces          990;
        startFace       115434;
    }
    maxX
    {
        type            patch;
        nFaces          990;
        startFace       116424;
    }
    minY
    {
        type            patch;
        nFaces          990;
        startFace       117414;
    }
    maxZ
    {
        type            patch;
        nFaces          900;
        startFace       118404;
    }
    fmaxY
    {
        type            patch;
        nFaces          90;
        startFace       119304;
    }
    fminX
    {
        type            patch;
        nFaces          90;
        startFace       119394;
    }
    fmaxX
    {
        type            patch;
        nFaces          90;
        startFace       119484;
    }
    fminY
    {
        type            patch;
        nFaces          90;
        startFace       119574;
    }
    fminZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       119664;
    }
)

// ************************************************************************* //
